In [1]:
import pandas as pd
titanic_data ={
    "PassengerId": [1,2,3,4,5,6,7],
    "Name": ["A","B","C","D","E","F","G"],
    "Sex": ["M","F","M","F","M","F","M"],
    "Pclass": [3,1,2,3,4,5,6],
    "Survived": [0,1,2,3,4,5,6],
    "Fare": [71.23,5.23,4.67,7.88,9.88,9.77,8.88],
    "Embarked": ["S","C","Q","S","C","Q","S"]
}
df = pd.DataFrame(titanic_data)
print(df)

   PassengerId Name Sex  Pclass  Survived   Fare Embarked
0            1    A   M       3         0  71.23        S
1            2    B   F       1         1   5.23        C
2            3    C   M       2         2   4.67        Q
3            4    D   F       3         3   7.88        S
4            5    E   M       4         4   9.88        C
5            6    F   F       5         5   9.77        Q
6            7    G   M       6         6   8.88        S

In [8]:
import pandas as pd
print(df['Sex'].unique())

[0 1]

In [2]:
df['Sex'] = df['Sex'].map({'M': 0, 'F': 1})
df['Sex'].head()

0    0
1    1
2    0
3    1
4    0
Name: Sex, dtype: int64

In [5]:
#one-hot encoding (creating dummy variable) :explanation:it converts each category into a separate binary column(0,1).useful when  categorical variable has more than 2 categories ,like embarked (c,q,s)eg:encoding the embarked column
df_encoded=pd.get_dummies(df,columns=['Embarked'],dtype=int)
print(df_encoded.head())

   PassengerId Name  Sex  Pclass  Survived   Fare  Embarked_C  Embarked_Q  \
0            1    A    0       3         0  71.23           0           0
1            2    B    1       1         1   5.23           1           0
2            3    C    0       2         2   4.67           0           1
3            4    D    1       3         3   7.88           0           0
4            5    E    0       4         4   9.88           1           0

   Embarked_S
0           1
1           0
2           0
3           1
4           0

In [9]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler

In [10]:
data = pd.DataFrame({'Profit':[200,500,1000,1500,3000]})

In [11]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler
data=pd.DataFrame({'profit':[200,500,1000,1500,3000]})
scaler=MinMaxScaler()
data['profit_normalized']=scaler.fit_transform(data[['profit']])
print(data)

   profit  profit_normalized
0     200           0.000000
1     500           0.107143
2    1000           0.285714
3    1500           0.464286
4    3000           1.000000

In [12]:
import numpy as np
data=pd.DataFrame({'Sales':[1000,2000,3000,4000,5000]})
data['log_sales']=np.log(data['Sales'])
print(data)

   Sales  log_sales
0   1000   6.907755
1   2000   7.600902
2   3000   8.006368
3   4000   8.294050
4   5000   8.517193